RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_sdio.c
/********************************** (C) COPYRIGHT  *******************************
* File Name          : ch32f20x_SDIO.c
* Author             : WCH
* Version            : V1.0.0
* Date               : 2021/08/08
* Description        : This file provides all the SDIO firmware functions.
*******************************************************************************/
#include "ch32f20x_sdio.h"
#include "ch32f20x_rcc.h"


#define SDIO_OFFSET              (SDIO_BASE - PERIPH_BASE)

/* CLKCR register clear mask */
#define CLKCR_CLEAR_MASK         ((uint32_t)0xFFFF8100) 

/* SDIO PWRCTRL Mask */
#define PWR_PWRCTRL_MASK         ((uint32_t)0xFFFFFFFC)

/* SDIO DCTRL Clear Mask */
#define DCTRL_CLEAR_MASK         ((uint32_t)0xFFFFFF08)

/* CMD Register clear mask */
#define CMD_CLEAR_MASK           ((uint32_t)0xFFFFF800)

/* SDIO RESP Registers Address */
#define SDIO_RESP_ADDR           ((uint32_t)(SDIO_BASE + 0x14))

/*******************************************************************************
* Function Name  : SDIO_DeInit
* Description    : Deinitializes the SDIO peripheral registers to their default reset values.
* Input          : None
* Return         : None
*******************************************************************************/
void SDIO_DeInit(void)
{
  SDIO->POWER = 0x00000000;
  SDIO->CLKCR = 0x00000000;
  SDIO->ARG = 0x00000000;
  SDIO->CMD = 0x00000000;
  SDIO->DTIMER = 0x00000000;
  SDIO->DLEN = 0x00000000;
  SDIO->DCTRL = 0x00000000;
  SDIO->ICR = 0x00C007FF;
  SDIO->MASK = 0x00000000;
}

/*******************************************************************************
* Function Name  : SDIO_Init
* Description    : Initializes the SDIO peripheral according to the specified
*      parameters in the SDIO_InitStruct.
* Input          : SDIO_InitStruct : pointer to a SDIO_InitTypeDef structure
*      that contains the configuration information for the SDIO peripheral.
* Return         : None
*******************************************************************************/
void SDIO_Init(SDIO_InitTypeDef* SDIO_InitStruct)
{
  uint32_t tmpreg = 0;
   
  tmpreg = SDIO->CLKCR;
  tmpreg &= CLKCR_CLEAR_MASK;
  tmpreg |= (SDIO_InitStruct->SDIO_ClockDiv  | SDIO_InitStruct->SDIO_ClockPowerSave |
             SDIO_InitStruct->SDIO_ClockBypass | SDIO_InitStruct->SDIO_BusWide |
             SDIO_InitStruct->SDIO_ClockEdge | SDIO_InitStruct->SDIO_HardwareFlowControl); 

  SDIO->CLKCR = tmpreg;
}

/*******************************************************************************
* Function Name  : SDIO_StructInit
* Description    : Fills each SDIO_InitStruct member with its default value.
* Input          : SDIO_InitStruct: pointer to an SDIO_InitTypeDef structure which
*                    will be initialized.
* Return         : None
*******************************************************************************/
void SDIO_StructInit(SDIO_InitTypeDef* SDIO_InitStruct)
{
  SDIO_InitStruct->SDIO_ClockDiv = 0x00;
  SDIO_InitStruct->SDIO_ClockEdge = SDIO_ClockEdge_Rising;
  SDIO_InitStruct->SDIO_ClockBypass = SDIO_ClockBypass_Disable;
  SDIO_InitStruct->SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
  SDIO_InitStruct->SDIO_BusWide = SDIO_BusWide_1b;
  SDIO_InitStruct->SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
}

/*******************************************************************************
* Function Name  : SDIO_ClockCmd
* Description    : Enables or disables the SDIO Clock.
* Input          : SDIO_InitStruct: pointer to an SDIO_InitTypeDef structure which
*                    will be initialized.
*                  NewState£ºENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void SDIO_ClockCmd(FunctionalState NewState)
{
  if(NewState) SDIO->CLKCR |= ((uint32_t)1<<8);
  else SDIO->CLKCR &= ~((uint32_t)1<<8);
}

/*******************************************************************************
* Function Name  : SDIO_SetPowerState
* Description    : Sets the power status of the controller.
* Input          : SDIO_PowerState: new state of the Power state.
*                    SDIO_PowerState_OFF
*                    SDIO_PowerState_ON
* Return         : None
*******************************************************************************/
void SDIO_SetPowerState(uint32_t SDIO_PowerState)
{
  
  SDIO->POWER &= PWR_PWRCTRL_MASK;
  SDIO->POWER |= SDIO_PowerState;
}

/*******************************************************************************
* Function Name  : SDIO_GetPowerState
* Description    : Gets the power status of the controller.
* Input          : None
* Return         :
*                  - 0x00: Power OFF
*                  - 0x02: Power UP
*                  - 0x03: Power ON
*******************************************************************************/
uint32_t SDIO_GetPowerState(void)
{
  return (SDIO->POWER & (~PWR_PWRCTRL_MASK));
}

/*******************************************************************************
* Function Name  : SDIO_ITConfig
* Description    : Enables or disables the SDIO interrupts.
* Input          : DIO_IT: specifies the SDIO interrupt sources to be enabled or disabled.
*                    SDIO_IT_CCRCFAIL
*                    SDIO_IT_DCRCFAIL
*                    SDIO_IT_CTIMEOUT
*                    SDIO_IT_DTIMEOUT
*                    SDIO_IT_TXUNDERR
*                    SDIO_IT_RXOVERR
*                    SDIO_IT_CMDREND
*                    SDIO_IT_CMDSENT
*                    SDIO_IT_DATAEND
*                    SDIO_IT_STBITERR
*                    SDIO_IT_DBCKEND
*                    SDIO_IT_CMDACT
*                    SDIO_IT_TXACT
*                    SDIO_IT_RXACT
*                    SDIO_IT_TXFIFOHE
*                    SDIO_IT_RXFIFOHF
*                    SDIO_IT_TXFIFOF
*                    SDIO_IT_RXFIFOF
*                    SDIO_IT_TXFIFOE
*                    SDIO_IT_RXFIFOE
*                    SDIO_IT_TXDAVL
*                    SDIO_IT_RXDAVL
*                    SDIO_IT_SDIOIT
*                    SDIO_IT_CEATAEND
*                  NewState:ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void SDIO_ITConfig(uint32_t SDIO_IT, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    SDIO->MASK |= SDIO_IT;
  }
  else
  {
    SDIO->MASK &= ~SDIO_IT;
  } 
}

