RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_sdio.c
/*******************************************************************************
* Function Name  : SDIO_GetFIFOCount
* Description    : Returns the number of words left to be written to or read from FIFO.
* Input          : None
* Return         : Remaining number of words.
*******************************************************************************/
uint32_t SDIO_GetFIFOCount(void)
{ 
  return SDIO->FIFOCNT;
}

/*******************************************************************************
* Function Name  : SDIO_StartSDIOReadWait
* Description    : Starts the SD I/O Read Wait operation.
* Input          : NewState£ºENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void SDIO_StartSDIOReadWait(FunctionalState NewState)
{ 
  if(NewState) SDIO->DCTRL |= ((uint32_t)1<<8);
  else SDIO->DCTRL &= ~((uint32_t)1<<8);
}

/*******************************************************************************
* Function Name  : SDIO_StopSDIOReadWait
* Description    : Stops the SD I/O Read Wait operation.
* Input          : NewState£ºENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void SDIO_StopSDIOReadWait(FunctionalState NewState)
{ 
  if(NewState) SDIO->DCTRL |= ((uint32_t)1<<9);
  else SDIO->DCTRL &= ~((uint32_t)1<<9);

}

/*******************************************************************************
* Function Name  : SDIO_SetSDIOReadWaitMode
* Description    : Sets one of the two options of inserting read wait interval.
* Input          : SDIO_ReadWaitMode: SD I/O Read Wait operation mode.
*                    SDIO_ReadWaitMode_CLK: Read Wait control by stopping SDIOCLK
*                    SDIO_ReadWaitMode_DATA2: Read Wait control using SDIO_DATA2
* Return         : None
*******************************************************************************/
void SDIO_SetSDIOReadWaitMode(uint32_t SDIO_ReadWaitMode)
{
  if(SDIO_ReadWaitMode) SDIO->DCTRL |= ((uint32_t)1<<10);
  else SDIO->DCTRL &= ~((uint32_t)1<<10);
}

/*******************************************************************************
* Function Name  : SDIO_SetSDIOOperation
* Description    : Enables or disables the SD I/O Mode Operation.
* Input          : NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void SDIO_SetSDIOOperation(FunctionalState NewState)
{ 
  if(NewState) SDIO->DCTRL |= ((uint32_t)1<<11);
  else SDIO->DCTRL &= ~((uint32_t)1<<11);
}

/*******************************************************************************
* Function Name  : SDIO_SendSDIOSuspendCmd
* Description    : Enables or disables the SD I/O Mode suspend command sending.
* Input          : NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void SDIO_SendSDIOSuspendCmd(FunctionalState NewState)
{ 
  if(NewState) SDIO->CMD |= ((uint32_t)1<<11);
  else SDIO->CMD &= ~((uint32_t)1<<11);
}

/*******************************************************************************
* Function Name  : SDIO_CommandCompletionCmd
* Description    : Enables or disables the command completion signal.
* Input          : NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void SDIO_CommandCompletionCmd(FunctionalState NewState)
{ 
  if(NewState) SDIO->CMD |= ((uint32_t)1<<12);
  else SDIO->CMD &= ~((uint32_t)1<<12);
}

/*******************************************************************************
* Function Name  : SDIO_CEATAITCmd
* Description    : Enables or disables the CE-ATA interrupt.
* Input          : NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void SDIO_CEATAITCmd(FunctionalState NewState)
{ 
  if(NewState) SDIO->CMD |= ((uint32_t)1<<13);
  else SDIO->CMD &= ~((uint32_t)1<<13);
}

/*******************************************************************************
* Function Name  : SDIO_SendCEATACmd
* Description    : Sends CE-ATA command (CMD61).
* Input          : NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void SDIO_SendCEATACmd(FunctionalState NewState)
{ 
  if(NewState) SDIO->CMD |= ((uint32_t)1<<14);
  else SDIO->CMD &= ~((uint32_t)1<<14);
}

/*******************************************************************************
* Function Name  : SDIO_GetFlagStatus
* Description    : Checks whether the specified SDIO flag is set or not.
* Input          : SDIO_FLAG: specifies the flag to check.
*                    SDIO_FLAG_CCRCFAIL: Command response received (CRC check failed)
*                    SDIO_FLAG_DCRCFAIL: Data block sent/received (CRC check failed)
*                    SDIO_FLAG_CTIMEOUT: Command response timeout
*                    SDIO_FLAG_DTIMEOUT: Data timeout
*                    SDIO_FLAG_TXUNDERR: Transmit FIFO underrun error
*                    SDIO_FLAG_RXOVERR:  Received FIFO overrun error
*                    SDIO_FLAG_CMDREND:  Command response received (CRC check passed)
*                    SDIO_FLAG_CMDSENT:  Command sent (no response required)
*                    SDIO_FLAG_DATAEND:  Data end (data counter, SDIDCOUNT, is zero)
*                    SDIO_FLAG_STBITERR: Start bit not detected on all data signals in wide
*                              bus mode.
*                    SDIO_FLAG_DBCKEND:  Data block sent/received (CRC check passed)
*                    SDIO_FLAG_CMDACT:   Command transfer in progress
*                    SDIO_FLAG_TXACT:    Data transmit in progress
*                    SDIO_FLAG_RXACT:    Data receive in progress
*                    SDIO_FLAG_TXFIFOHE: Transmit FIFO Half Empty
*                    SDIO_FLAG_RXFIFOHF: Receive FIFO Half Full
*                    SDIO_FLAG_TXFIFOF:  Transmit FIFO full
*                    SDIO_FLAG_RXFIFOF:  Receive FIFO full
*                    SDIO_FLAG_TXFIFOE:  Transmit FIFO empty
*                    SDIO_FLAG_RXFIFOE:  Receive FIFO empty
*                    SDIO_FLAG_TXDAVL:   Data available in transmit FIFO
*                    SDIO_FLAG_RXDAVL:   Data available in receive FIFO
*                    SDIO_FLAG_SDIOIT:   SD I/O interrupt received
*                    SDIO_FLAG_CEATAEND: CE-ATA command completion signal received for CMD61
* Return         : ITStatus£ºSET or RESET
*******************************************************************************/
FlagStatus SDIO_GetFlagStatus(uint32_t SDIO_FLAG)
{ 
  FlagStatus bitstatus = RESET;
  
  if ((SDIO->STA & SDIO_FLAG) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}


