RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_sdio.c
/*******************************************************************************
* Function Name  : SDIO_ClearFlag
* Description    : Clears the SDIO's pending flags.
* Input          : SDIO_FLAG: specifies the flag to clear.
*                    SDIO_FLAG_CCRCFAIL: Command response received (CRC check failed)
*                    SDIO_FLAG_DCRCFAIL: Data block sent/received (CRC check failed)
*                    SDIO_FLAG_CTIMEOUT: Command response timeout
*                    SDIO_FLAG_DTIMEOUT: Data timeout
*                    SDIO_FLAG_TXUNDERR: Transmit FIFO underrun error
*                    SDIO_FLAG_RXOVERR:  Received FIFO overrun error
*                    SDIO_FLAG_CMDREND:  Command response received (CRC check passed)
*                    SDIO_FLAG_CMDSENT:  Command sent (no response required)
*                    SDIO_FLAG_DATAEND:  Data end (data counter, SDIDCOUNT, is zero)
*                    SDIO_FLAG_STBITERR: Start bit not detected on all data signals in wide
*                              bus mode
*                    SDIO_FLAG_DBCKEND:  Data block sent/received (CRC check passed)
*                    SDIO_FLAG_SDIOIT:   SD I/O interrupt received
*                    SDIO_FLAG_CEATAEND: CE-ATA command completion signal received for CMD61
* Return         : None
*******************************************************************************/
void SDIO_ClearFlag(uint32_t SDIO_FLAG)
{
  SDIO->ICR = SDIO_FLAG;
}

/*******************************************************************************
* Function Name  : SDIO_GetITStatus
* Description    : Checks whether the specified SDIO interrupt has occurred or not.
* Input          : SDIO_IT: specifies the SDIO interrupt source to check.
*                    SDIO_IT_CCRCFAIL: Command response received (CRC check failed) interrupt
*                    SDIO_IT_DCRCFAIL: Data block sent/received (CRC check failed) interrupt
*                    SDIO_IT_CTIMEOUT: Command response timeout interrupt
*                    SDIO_IT_DTIMEOUT: Data timeout interrupt
*                    SDIO_IT_TXUNDERR: Transmit FIFO underrun error interrupt
*                    SDIO_IT_RXOVERR:  Received FIFO overrun error interrupt
*                    SDIO_IT_CMDREND:  Command response received (CRC check passed) interrupt
*                    SDIO_IT_CMDSENT:  Command sent (no response required) interrupt
*                    SDIO_IT_DATAEND:  Data end (data counter, SDIDCOUNT, is zero) interrupt
*                    SDIO_IT_STBITERR: Start bit not detected on all data signals in wide
*                            bus mode interrupt
*                    SDIO_IT_DBCKEND:  Data block sent/received (CRC check passed) interrupt
*                    SDIO_IT_CMDACT:   Command transfer in progress interrupt
*                    SDIO_IT_TXACT:    Data transmit in progress interrupt
*                    SDIO_IT_RXACT:    Data receive in progress interrupt
*                    SDIO_IT_TXFIFOHE: Transmit FIFO Half Empty interrupt
*                    SDIO_IT_RXFIFOHF: Receive FIFO Half Full interrupt
*                    SDIO_IT_TXFIFOF:  Transmit FIFO full interrupt
*                    SDIO_IT_RXFIFOF:  Receive FIFO full interrupt
*                    SDIO_IT_TXFIFOE:  Transmit FIFO empty interrupt
*                    SDIO_IT_RXFIFOE:  Receive FIFO empty interrupt
*                    SDIO_IT_TXDAVL:   Data available in transmit FIFO interrupt
*                    SDIO_IT_RXDAVL:   Data available in receive FIFO interrupt
*                    SDIO_IT_SDIOIT:   SD I/O interrupt received interrupt
*                    SDIO_IT_CEATAEND: CE-ATA command completion signal received for CMD61 interrupt
* Return         : ITStatus£ºSET or RESET
*******************************************************************************/
ITStatus SDIO_GetITStatus(uint32_t SDIO_IT)
{ 
  ITStatus bitstatus = RESET;
  
  if ((SDIO->STA & SDIO_IT) != (uint32_t)RESET)  
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/*******************************************************************************
* Function Name  : SDIO_ClearITPendingBit
* Description    : Clears the SDIO's interrupt pending bits.
* Input          : SDIO_IT: specifies the interrupt pending bit to clear.
*                    SDIO_IT_CCRCFAIL: Command response received (CRC check failed) interrupt
*                    SDIO_IT_DCRCFAIL: Data block sent/received (CRC check failed) interrupt
*                    SDIO_IT_CTIMEOUT: Command response timeout interrupt
*                    SDIO_IT_DTIMEOUT: Data timeout interrupt
*                    SDIO_IT_TXUNDERR: Transmit FIFO underrun error interrupt
*                    SDIO_IT_RXOVERR:  Received FIFO overrun error interrupt
*                    SDIO_IT_CMDREND:  Command response received (CRC check passed) interrupt
*                    SDIO_IT_CMDSENT:  Command sent (no response required) interrupt
*                    SDIO_IT_DATAEND:  Data end (data counter, SDIDCOUNT, is zero) interrupt
*                    SDIO_IT_STBITERR: Start bit not detected on all data signals in wide
*                            bus mode interrupt
*                    SDIO_IT_SDIOIT:   SD I/O interrupt received interrupt
*                    SDIO_IT_CEATAEND: CE-ATA command completion signal received for CMD61
* Return         : None
*******************************************************************************/
void SDIO_ClearITPendingBit(uint32_t SDIO_IT)
{
  SDIO->ICR = SDIO_IT;
}
